Repository: havardAasen/linuxcnc
Catalog: src/po/gmoccapy/*.po
Languages: ru

source: Switch motion mode between Joint and World mode F12 or $ key does the same
ru: Переключение режима движения между совместным и мировым режимом F12 или клавиша $ делают то же самое

source: make the preview as large as possible
ru: сделайте предварительный просмотр как можно большим

source: Close gmoccapy / leave the program
ru: Закройте gmoccapy/выйдите из программы

source: Load a new program
ru: Загрузите новую программу

source: Run the loaded program
ru: Запускаем загруженную программу

source: Stop the running program
ru: Остановить работающую программу

source: Pause the running program
ru: Приостановить работающую программу

source: Run the loaded program step by step
ru: Запустите загруженную программу шаг за шагом

source: run the program from a certain line, attention, that is dangerous, because the previous lines will not checked!
ru: запускать программу с определенной строки, внимание, это опасно, так как предыдущие строки не будут проверены!

source: Machine or not the optional blocks of the program. If the button is pressed, the optional blocks will not be machined. The button will indicate this by a yellow background.
ru: Машина или не дополнительные блоки программы. Если кнопка нажата, дополнительные блоки не будут обработаны. Кнопка будет указывать это на желтом фоне.

source: Edit the loaded program
ru: Редактировать загруженную программу

source: delete MDI history
ru: удалить историю MDI

source: Delete MDI history
ru: удалить историю MDI

source: Cl.-ladder
ru: кл.-лестница

source: Open classicladder
ru: Открытая классическая лестница

source: Hal-Scope
ru: Хал-Скоуп

source: launch hal scope
ru: объем запуска хал

source: Status
ru: Статус

source: launch linuxcnc status
ru: состояние запуска linuxcnc

source: Hal Meter
ru: HAL-метр

source: launch hal meter
ru: запуск hal-метра

source: Calibration
ru: Калибровка

source: launch calibration
ru: запустить калибровку

source: Halshow
ru: Хэлшоу

source: opens the show hal tool
ru: открывает шоу hal инструмент

source: save the file using the original name
ru: сохраните файл, используя исходное имя

source: save the file with a new name
ru: сохраните файл под новым именем

source: clear the edit field and make a new file
ru: очистите поле редактирования и создайте новый файл

source: Show or hide the virtual keyboard
ru: Показать или скрыть виртуальную клавиатуру

source: Go back to main button list
ru: Вернуться к основному списку кнопок

source: Delete
ru: Удалить

source: delete selected tool or tools
ru: удалить выбранный инструмент или инструменты

source: Add
ru: Добавить

source: add a new tool to tool table
ru: добавить новый инструмент к таблице инструментов

source: Reload
ru: Перегрузка

source: reload tool table from file
ru: перезагрузить таблицу инструментов из файла

source: Apply
ru: Применить

source: apply the changes you made, G43 will be executed only if it is active G-code
ru: примените внесенные вами изменения, G43 будет выполняться только в том случае, если активен G-код

source: Select a tool by number
ru: Выберите инструмент по номеру

source: change tool with the command M61 Q?, no machine move will be done
ru: смените инструмент с помощью команды M61 Q?, перемещение станка выполняться не будет

source: change tool to the selected one
ru: изменить инструмент на выбранный

source: touch off the tool and set the value to the tool table
ru: отключите инструмент и установите значение в таблицу инструментов

source: touchoff tool x
ru: касание отключить инструмент х

source: touchoff tool z
ru: касание отключить инструмент z

source: Move to your home directory
ru: Переместить в свой домашний каталог

source: Move to parent directory
ru: Переместить в родительский каталог

source: Select the previous file
ru: Выберите предыдущий файл

source: Select the next file
ru: Выберите следующий файл

source: Jump to user defined directory
ru: Перейти к пользовательскому каталогу

source: select the highlighted file and return the path
ru: выберите выделенный файл и верните путь

source: Close without returning a file path
ru: Закрыть без возврата пути к файлу

source: Load File
ru: Загрузить файл

source: home joints
ru: домашние суставы
