Repository: havardAasen/linuxcnc
Catalog: src/po/gmoccapy/*.po
Languages: ru

source: user mode selected
ru: выбран пользовательский режим

source: logo entry found = {0}
ru: найдена запись логотипа = {0}

source: Logofile entry found, but could not be converted to path.
ru: Запись в файле логотипа найдена, но не может быть преобразована в путь.

source: The file path should not contain any spaces
ru: Путь к файлу не должен содержать пробелов

source: Error in
ru: Ошибка в

source: Please check the console output.
ru: Пожалуйста, проверьте вывод консоли.

source: axis
ru: ось

source: axes
ru: осей

source: joint
ru: Сочленение

source: joints
ru: суставы

source: Press to home all {0}
ru: Нажмите, чтобы вернуться домой {0}

source: Press to display previous homing button
ru: Нажмите, чтобы отобразить предыдущую кнопку возврата

source: Press to home {0} {1}
ru: Нажмите, чтобы вернуться домой {0} {1}

source: Press to display next homing button
ru: Нажмите, чтобы отобразить следующую кнопку возврата домой

source: Press to unhome all {0}
ru: Нажмите, чтобы отменить все {0}

source: Press to return to main button list
ru: Нажмите, чтобы вернуться к основному списку кнопок

source: could not resolv the image path '{0}' given for button '{1}'
ru: не удалось разрешить путь к изображению "{0}", указанный для кнопки "{1}"

source: edit offsets
ru: редактировать смещения

source: Press to edit the offsets
ru: Нажмите, чтобы изменить смещения

source: Press to set touch off value for axis {0}
ru: Нажмите, чтобы установить значение касания для оси {0}

source: Press to reset all G92 offsets
ru: Нажмите, чтобы сбросить все смещения G92

source: Block Height
ru: Блокировать Высота

source: Press to enter new value for block height
ru: Нажмите, чтобы ввести новое значение высоты блока

source: set selected
ru: набор выбрано

source: Press to set the selected coordinate system to be the active one
ru: Нажмите, чтобы сделать выбранную систему координат активной

source: No valid probe config in INI File. Tool measurement disabled.
ru: В INI файле нет допустимой конфигурации зонда. Измерение инструмента отключено.

source: Found valid probe config in INI file. Will use auto tool measurement.
ru: В INI-файле обнаружена действительная конфигурация зонда. Будет использоваться автоматическое измерение инструмента.

source: To many increments given in INI File for this screen. Only the first 10 will be reachable through this screen.
ru: Слишком много приращений, указанных в INI-файле для этого экрана. Через этот экран будут доступны только первые 10.

source: Continuous
ru: Непрерывно

source: unknown jog command {0}
ru: неизвестная команда толчка {0}

source: Press to jog axis {0}
ru: Нажмите, чтобы переместить ось {0}

source: Press to jog joint {0}
ru: Нажмите, чтобы переместить шарнир {0}

source: GMOCCAPY INFO
ru: ИНФОРМАЦИЯ О GMOCCAPY

source: found more than 16 macros, will use only the first 16
ru: найдено более 16 макросов, буду использовать только первые 16

source: Press to display previous macro button
ru: Нажмите, чтобы отобразить кнопку предыдущего макроса

source: Press to run macro {0}
ru: Нажмите, чтобы запустить макрос {0}

source: Press to display next macro button
ru: Нажмите, чтобы отобразить кнопку следующего макроса

source: Press to display the virtual keyboard
ru: Нажмите, чтобы отобразить виртуальную клавиатуру

source: * GMOCCAPY ERROR *
ru: * ОШИБКА GMOCCAPY*

source: this is not a lathe, as a lathe must have at least
ru: это не токарный станок, так как токарный станок должен иметь как минимум

source: an X and an Z axis
ru: оси X и Z

source: Wrong lathe configuration, we will leave here
ru: Неправильная конфигурация станка, оставим здесь

source: Very critical situation
ru: Очень критическая ситуация

source: this is not a usual config
ru: это не обычная конфигурация

source: we miss one of X , Y or Z axis
ru: мы пропускаем одну из осей X, Y или Z

source: We will use by axisletter ordered jog button
ru: Мы будем использовать кнопку перемещения по буквам оси

source: mm/min
ru: мм/мин

source: inch/min
ru: дюйм/мин

source: No embedded tabs configured or invalid configuration. No tabs will be added!
ru: Встроенные вкладки не настроены или неверная конфигурация. Вкладки добавлены не будут!

source: ERROR, trying to initialize the user tabs or panels, check for typos
ru: ОШИБКА, пытаюсь инициализировать пользовательские вкладки или панели, проверьте на наличие опечаток

source: Did not find a toolfile file in [EMCIO] TOOL_TABLE
ru: Не найден файл файла инструмента в [EMCIO] ИНСТРУМЕНТ_ТАБЛИЦА

source: Audio available!
ru: Аудио доступно!

source: Audio enabled!
ru: Звук включен!

source: Audio disabled!
ru: Звук отключен!

source: No audio available! PYGST library not installed? Is python-gstX.XX installed?
ru: Звук отсутствует! Библиотека PYGST не установлена? Установлен ли python-gstX.XX?

source: Joint mode
ru: Соединение режим

source: Virtual keyboard program found : <onboard>
ru: Обнаружена программа виртуальной клавиатуры: <onboard>

source: No virtual keyboard installed, we checked for <onboard>. Try 'sudo apt-get install onboard'.
ru: Виртуальная клавиатура не установлена, мы проверили <onboard>. Попробуйте 'sudo apt-get install onboard'.

source: Error with launching virtual keyboard. Is onboard installed?Try sudo apt-get install onboard
ru: Ошибка при запуске виртуальной клавиатуры. Установлен ли бортовой компьютер? Попробуйте sudo apt-get install onboard

source: interrupt running macro
ru: прервать выполнение макроса

source: Did not find a parameter file in [RS274NGC] PARAMETER_FILE
ru: Не найден файл параметров в [RS274NGC] PARAMETER_FILE

source: Select the file you want to be loaded at program start
ru: Выберите файл, который вы хотите загрузить при запуске программы

source: Message type {0} not supported
ru: Тип сообщения {0} не поддерживается

source: Unknown error type and no error text given
ru: Неизвестный тип ошибки, текст ошибки не указан

source: Important Warning
ru: Важное предупреждение

source: External ESTOP is set, could not change state!
ru: Установлен внешний ESTOP, изменить состояние невозможно!

source: Could not switch the machine on, is limit switch activated?
ru: Не удалось включить машину, активирован ли концевой выключатель?

source: No file loaded
ru: Ни один файл не загружен

source: It is not possible to change to MDI Mode at the moment
ru: В данный момент невозможно перейти в режим MDI

source: It is not possible to change to Auto Mode at the moment
ru: В данный момент невозможно перейти в автоматический режим

source: Enter value:
ru: Введите значение:

source: Set parameter {0} to:
ru: Установите для параметра {0} значение:

source: Conversion error !
ru: Ошибка преобразования !

source: This button will show or hide the keyboard
ru: Эта кнопка покажет или скроет клавиатуру

source: Mode change is only allowed if the interpreter is idle!
ru: Смена режима разрешена только в том случае, если переводчик не работает!

source: No tool description available
ru: Описание инструмента отсутствует

source: Halo, welcome to the test message {0}
ru: Halo, добро пожаловать в тестовое сообщение {0}

source: Hal Pin is low, Access denied
ru: Hal Pin имеет низкий уровень, доступ запрещен

source: wrong code entered, Access denied
ru: введен неправильный код, Доступ запрещен

source: Just to warn you
ru: Просто чтобы предупредить тебя

source: INFO:
ru: ИНФОРМАЦИЯ:

source: Classicladder real-time component not detected
ru: Компонент классической лестницы реального времени не обнаружен

source: Do you really want to delete the MDI history?
ru: Вы действительно хотите удалить историю MDI?

source: This will not delete the MDI History file, but will
ru: Это не приведет к удалению файла истории MDI, но

source: delete the listbox entries for this session.
ru: удалите записи списка для этого сеанса.

source: Attention!!
ru: Внимание!!

source: Exit and discard changes?
ru: Выйти и отменить изменения?

source: Attention!
ru: Внимание!

source: Enter value for diameter
ru: Введите значение диаметра

source: Set diameter to:
ru: Установите диаметр:

source: Enter value for radius
ru: Введите значение радиуса

source: Set radius to:
ru: Установите радиус:

source: Enter value for axis {0}
ru: Введите значение для оси {0}

source: Set axis {0} to:
ru: Установите ось {0} на:

source: Conversion error in btn_set_value!
ru: Ошибка преобразования в btn_set_value!

source: Please enter only numerical values. Values have not been applied
ru: Пожалуйста, вводите только числовые значения. Значения не были применены

source: You did not select a system to be changed to, so nothing will be changed
ru: Вы не выбрали систему для перехода, поэтому ничего не изменится

source: Important Warning!
ru: Важное предупреждение!

source: Enter the block height
ru: Введите высоту блока

source: Block height measured from base table
ru: Высота блока измеряется от базового стола

source: Conversion error in btn_block_height!
ru: Ошибка преобразования в btn_block_height!

source: Please enter only numerical values Values have not been applied
ru: Пожалуйста, вводите только числовые значения Значения не были применены

source: Please remove the mounted tool and press OK when done
ru: Пожалуйста, снимите установленный инструмент и нажмите ОК, когда закончите

source: Please change to tool # {0:d} {1} then click OK.
ru: Пожалуйста, измените на инструмент # {0:d} {1} затем нажмите ОК.

source: Tool # {0:d} not in the tool table!
ru: Инструмент # {0:d} нет в таблице инструментов!

source: Manual Tool change
ru: Ручная смена инструмента

source: Tool Change has been aborted!
ru: Смена инструмента прервана!

source: The old tool will remain set!
ru: Старый инструмент останется на месте!

source: You are trying to delete the tool mounted in the spindle
ru: Вы пытаетесь удалить инструмент, установленный в шпиндель

source: This is not allowed, please change tool prior to delete it
ru: Это запрещено, пожалуйста, измените инструмент, прежде чем удалять его

source: Warning Tool can not be deleted!
ru: Внимание Инструмент нельзя удалить!

source: No or multiple tools selected in the tool table.
ru: В таблице инструментов не выбрано ни одного инструмента или несколько инструментов.

source: Please select only one tool in the table!
ru: Пожалуйста, выберите в таблице только один инструмент!

source: Warning Tool Touch off not possible!
ru: Инструмент предупреждения Отключение невозможно!

source: You can not touch off a tool, which is not mounted in the spindle!
ru: Вы не можете отключить инструмент, который не установлен в шпиндель!

source: Your selection has been reset to the tool in spindle.
ru: Ваш выбор был сброшен на инструмент в шпинделе.

source: Tool touch off is not possible with cutter radius compensation switched on!
ru: Отключение инструмента невозможно с включенной компенсацией радиуса выреза!

source: Please emit an G40 before tool touch off.
ru: Пожалуйста, издайте G40 перед отключением инструмента.

source: Real big error!
ru: Настоящая большая ошибка!

source: You managed to come to a place that is not possible in on_btn_tool_touchoff
ru: Вам удалось попасть в место, которое невозможно в on_btn_tool_touchoff

source: Enter value for axis {0} to set:
ru: Введите значение для оси {0}, чтобы установить:

source: Set parameter of tool {0:d} and axis {1} to:
ru: Установите параметр инструмента {0:d} и оси {1} на:

source: Conversion error because of wrong entry for touch off axis {0}
ru: Ошибка преобразования из-за неправильного ввода оси касания {0}

source: Enter the tool number as integer
ru: Введите номер инструмента как целое число

source: Select the tool to change
ru: Выберите инструмент для изменения

source: Conversion error because of wrong entry for tool number.
ru: Ошибка преобразования из-за неправильной записи для номера инструмента.

source: Enter only integer numbers!
ru: Введите только целые числа!

source: Selected tool is already in spindle, no change needed.
ru: Выбранный инструмент уже установлен в шпинделе, никаких изменений не требуется.

source: you selected no or more than one tool, the tool selection must be unique
ru: вы не выбрали ни одного инструмента или несколько, выбор инструмента должен быть уникальным

source: Could not understand the entered tool number. Will not change anything!
ru: Невозможно понять введенный номер инструмента. Ничего не изменит!

source: World mode
ru: Мир режим

source: Axis jogging is only allowed in world mode, but you are in joint mode!
ru: Перемещение по осям разрешено только в мировом режиме, но вы находитесь в совместном режиме!

source: Enter System Unlock Code
ru: Введите код разблокировки системы

source: Enter value
ru: Введите значение

source: Enter the value to set
ru: Введите значение для установки

source: Operator Message
ru: Сообщение оператора

source: _Yes
ru: _Да

source: _No
ru: _Нет

source: _Ok
ru: _Хорошо

source: Restart Entry
ru: Перезапустить Запись

source: _Up
ru: _Вверх

source: _Down
ru: _Вниз

source: _Jump to
ru: _Перейти к

source: **** gmoccapy can only handle 9 axis, but you have given {0} through your INI file.
ru: **** gmoccapy может обрабатывать только 9 осей, но вы указали {0} в своем INI файле.

source: gmoccapy will not start ****
ru: gmoccapy не запускается ****

source: No subroutine folder or program prefix is given in the INI file!
ru: В файле INI отсутствует папка подпрограмм или префикс программы!

source: Error trying to delete the message with number {0}
ru: Ошибка попытки удалить сообщение с номером {0}

source: pause the running program
ru: приостановить работающую программу

source: left rotate, middle move, right zoom
ru: левый поворот, средний ход, правый зум

source: left zoom, middle move, right rotate
ru: масштабирование влево, перемещение в середине, поворот вправо

source: left move, middle rotate, right zoom
ru: левый ход, средний поворот, правый зум

source: left zoom, middle rotate, right move
ru: левый зум, средний поворот, правый ход

source: left move, middle zoom, right rotate
ru: левый ход, средний зум, правый поворот

source: left rotate, middle zoom, right move
ru: левый вращающийся, средний зум, правый ход

source: default
ru: нормальный

source: No Program loaded
ru: Программа не загружена

source: blockheight = 0.0
ru: высота блока = 0.0

source: view perspective
ru: просмотреть перспективу

source: view along the X axis from positive to negative
ru: вид вдоль оси X от положительной до отрицательной

source: view along the Y axis from positive to negative
ru: вид вдоль оси X от положительной до отрицательной

source: view along the Y axis from positive to negative as viewn for a back tool lathe
ru: вид вдоль оси Y от положительной до отрицательной, как вид для задней панели

source: view along the Z axis from positive to negative
ru: вид вдоль оси Z от положительной до отрицательной

source: Zoom in
ru: Приблизить

source: Zoom out
ru: Уменьшить

source: Show or hide dimensions
ru: Показать или скрыть размеры

source: Show or hide tool path
ru: Показать или скрыть путь инструмента

source: clear plot
ru: участок

source: Preview
ru: Просмотр

source: Offset Page
ru: Страница смещения

source: Tooledit
ru: Редактор таблицы инструментов

source: File Selection
ru: Выбор файла

source: jog axes
ru: толчковые топоры

source: jog joints
ru: беговые суставы

source: Logo
ru: Логотип

source: Ignore limits
ru: Игнорировать ограничения

source: <b>Jogging</b>
ru: <b>Бег</b>

source: Shows the code to execute
ru: Показать код для выполнения

source: Undo
ru: Отмена

source: Search back
ru: Поиск назад

source: Search Text:
ru: Найти Текст:

source: Replace Text:
ru: Заменить Текст:

source: Search fwd
ru: Поиск fwd

source: Ignore Case
ru: Игнорировать Дело

source: Replace All
ru: Заменить Все

source: Replace
ru: Заменить

source: Redo
ru: Повторить

source: Information over the tool in spindle
ru: Информация о инструменте в шпиндле

source: Tool no.
ru: Инструмента нет.

source: Diameter
ru: Диаметр

source: offset z
ru: смещение z

source: offset x
ru: смещение x

source: <b>Tool information</b>
ru: <b>Информация об инструменте</b>

source: G and M code information as well as speed and feed
ru: Информация о кодах G и M, а также скорость и подача

source: active_mcodes_label
ru: активный_код_метка

source: active_gcodes_label
ru: активные_gкоды_метка

source: <b>G-Code</b>
ru: <b>G-Код</b>

source: <b>Cooling</b>
ru: <b>Охлаждение</b>

source: <b>Spindle [rpm]</b>
ru: <b>Шпиндель [об/мин]</b>

source: Vel.
ru: Вел.

source: Displays the current velocity
ru: Показывает текущую скорость

source: <b>Rapid Override</b>
ru: <b>Быстрое переопределение</b>

source: Displays the programmed feed rate
ru: Отображает запрограммированную скорость подачи

source: reset feed override to 100 %
ru: сбросить коррекцию подачи на 100 %

source: <b>Feed Override</b>
ru: <b>Переопределение Подачи</b>

source: Main
ru: Главное

source: Start as fullscreen
ru: Начать в полноэкранном режиме

source: Start maximized
ru: Начните максимизировать

source: Start as window
ru: Начните с окна

source: X Pos.
ru: X Поз.

source: Y Pos.
ru: Y Поз.

source: Width
ru: Ширина

source: Height
ru: Высота

source: hide title bar
ru: скрыть заголовок

source: hide cursor
ru: скрыть курсор

source: hide tooltips
ru: скрыть инструменты

source: <b>Main Window</b>
ru: <b>Главное окно</b>

source: Show keyboard on offset
ru: Показать клавиатуру по смещению

source: Show keyboard on tooledit
ru: Показать клавиатуру на инструменте

source: Show keyboard on MDI
ru: Показать клавиатуру на MDI

source: Show keyboard on EDIT
ru: Показать клавиатуру на EDIT

source: Show keyboard on load file
ru: Показывать клавиатуру в файле загрузки

source: <b>Virtual Keyboard</b>
ru: <b>Виртуальная клавиатура</b>

source: show preview
ru: Предварительный просмотр

source: show offsets
ru: показать смещения

source: <b>On Touch off</b>
ru: <b>Вкл.Сенсор Выкл.</b>

source: Relative Color
ru: Относительный Цвет

source: Absolute Color
ru: Абсолютный Цвет

source: DTG Color
ru: DTG цвет

source: Homed color
ru: Домашний цвет

source: Unhomed color
ru: Неприемлемый цвет

source: Size
ru: Размер

source: Digits
ru: Цифры

source: toggle DRO mode clicking on the DRO
ru: включить режим DRO нажать на DRO

source: Grid size
ru: Размер сетки

source: Show DRO
ru: Показать DRO

source: Show offsets
ru: Показать отступы

source: Show DTG
ru: Показать DTG

source: <b>Mouse Button mode</b>
ru: <b>Режим кнопки мыши</b>

source: <b>Preview</b>
ru: <b>Предварительный просмотр</b>

source: current file
ru: текущий файл

source: none
ru: отсутствует

source: <b>File to load on start</b>
ru: <b>Файл для загрузки при запуске</b>

source: Select user dir
ru: Выберите каталог пользователя

source: <b>Select jump to dir</b>
ru: <b>Выбрать переход в каталог</b>

source: Themes
ru: Темы

source: Icon Theme
ru: Тема иконок

source: Alert Audio
ru: Звуковое оповещение

source: Warning Audio
ru: Предупреждение аудио

source: Enable sound
ru: Включить звук

source: <b>Themes and sound</b>
ru: <b>Темы и звук</b>

source: Appearance
ru: Оформление

source: Scale jog velocity
ru: Масштабировать скорость толчка

source: Scale rapid override
ru: Масштабное быстрое решение

source: Scale feed override
ru: Переопределение подачи масштаба

source: Scale spindle override
ru: Отмена масштабирования шпинделя

source: <b>Hardware MPG Scale</b>
ru: <b>Аппаратная шкала MPG</b>

source: Use keyboard shortcuts
ru: Используйте сочетания клавиш

source: <b>Keyboard shortcuts</b>
ru: <b>Быстрые клавиши</b>

source: Use unlock code
ru: Использовать код разблокировки

source: Do not use unlock code
ru: Не используйте код разблокировки

source: Use hal pin to unlock
ru: Используйте hal pin, чтобы разблокировать

source: <b>Unlock settings</b>
ru: <b>Разблокировать настройки</b>

source: Starting RPM
ru: Стартовая частота вращения

source: Spindle bar min
ru: Шпиндель, мин

source: Spindle bar max
ru: Шпиндель макс

source: <b>Spindle</b>
ru: <b>Шпиндель</b>

source: Hide turtle Jog Button
ru: Кнопка Скрыть черепаху

source: Turtle jog Factor
ru: Фактор бега черепахи

source: <b>Turtle Jog</b>
ru: <b>Черепашья пробежка</b>

source: Hardware
ru: Оборудование

source: Use auto tool measurement
ru: Использовать автоматическое измерение инструмента

source: Z Pos.
ru: Z Поз.

source: Max. Probe
ru: Макс. Зонд

source: Probe Height
ru: Высота зонда

source: <b>Probe Information</b>
ru: <b>Информация о зонде</b>

source: Search Vel.
ru: Поиск Вел.

source: Probe Vel.
ru: Зонд Ну.

source: <b>Probe velocitys</b>
ru: <b>Скорость зонда</b>

source: No valid configuration found in your INI file, please take a look at the WIKI to check how to configure the settings.
ru: Нет допустимой конфигурации находится в вашем INI-файле, пожалуйста, взгляните на Вики, чтобы проверить, как для настройки параметров.

source: <b>Tool Measurement</b>
ru: <b>Измерение инструмента</b>

source: Reload Tool on Start
ru: Перезагрузить инструмент при запуске

source: If checked, the tool in spindle will be saved on each change and the last tool will be reloaded at start of the GUI. Also it's length offset will be reloaded.
ru: Если этот флажок установлен, инструмент в шпинделе будет сохраняться при каждом изменении и последний инструмент будет перезагружен в начале графического интерфейса. Также это смещение длины будет перезагружено.

source: You use NO_FORCE_HOMING, so the reload of a tool at start is not possible.
ru: Вы используете NO_FORCE_HOMING, поэтому перезагрузка инструмента при запуске это невозможно.

source: <b>Reload Tool</b>
ru: <b>Инструмент перезагрузки</b>

source: Do not use run from line
ru: Не используйте запуск из строки

source: Use run from line
ru: Используйте запуск из строки

source: <b>Run from line</b>
ru: <b>Бежать с линии</b>

source: X-position in pixel from top left corner of the screen
ru: X-позиция в пикселях от верхнего левого угла экрана

source: Max. messages
ru: Макс. сообщения

source: Font
ru: Шрифт

source: Y-position in pixel from top left corner of the screen
ru: Позиция Y в пикселях от верхнего левого угла экрана

source: The width of the messages
ru: Ширина сообщений

source: The maximum messages you want to be shown
ru: Максимальное количество сообщений, которые вы хотите показать

source: The font to use
ru: Шрифт для использования

source: Use frames
ru: Используйте рамки

source: If checked, the messages will be in a frame.
ru: Если этот флажок установлен, сообщения будет в кадре.

source: Launch test message
ru: Запустить тестовое сообщение

source: Push here to launch a test message to test your settings.
ru: Нажмите здесь, чтобы запустить тестовое сообщение чтобы проверить ваши настройки.

source: <b> gmoccapy message behavior and appearance </b>
ru: <b> сообщение gmoccapy поведение и внешний вид </b>

source: Advanced Settings
ru: Расширенные Настройки

source: Settings
ru: Настройки

source: User tab 1
ru: Вкладка Пользователь 1

source: User tabs
ru: Вкладки пользователя

source: Estop the machine [F1]
ru: Остановите машину [Ф1]

source: Turn the machine on/off [F2]
ru: Включите/выключите машину [Ф2]

source: enter manual mode to jog axis by hand or touch off [F3]
ru: войдите в ручной режим для перемещения оси вручную или коснитесь [F3]

source: enter MDI mode to launch G-code commands [F5]
ru: войти в режим MDI для запуска команд G-кода [F5]

source: enter auto mode to run programs
ru: войти в автоматический режим для запуска программ

source: show user tabs
ru: показать вкладки пользователя

source: Enter the settings page, the default code is "123"
ru: Войдите на страницу настроек, код по умолчанию “123"

source: open homing button list
ru: открыть список кнопок возврата домой

source: open touch off button list
ru: открыть список кнопок отключения сенсорного экрана

source: Open the tooleditor page
ru: Откройте страницу редактора инструментов

source: World Mode
ru: Мир режим
